refactor(README): update apis
